portfolio/app/views/profiles/index.html.erb

SELECT "skills".* FROM "skills" WHERE "skills"."profile_id" = ?  [["profile_id", 1]]
---
<ul>
  <% @profile.skills.each do |skill|  %>