portifolio2/app/controllers/skills_controller.rb

SELECT  "skills".* FROM "skills" ORDER BY "skills"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @skills = Skill.all

INSERT INTO "skills" ("name", "years", "created_at", "updated_at", "profile_id") VALUES (?, ?, ?, ?, ?)  [["name", "Fazer Café"], ["years", 2], ["created_at", 2016-09-16 14:49:02 UTC], ["updated_at", 2016-09-16 14:49:02 UTC], ["profile_id", 1]]
---
  def create
    @skill = Skill.new(skill_params)
    @skill.profile_id = 1

    respond_to do |format|
      if @skill.save

UPDATE "skills" SET "years" = ?, "updated_at" = ? WHERE "skills"."id" = ?  [["years", 2], ["updated_at", 2016-09-16 12:37:05 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @skill.update(skill_params)

DELETE FROM "skills" WHERE "skills"."id" = ?  [["id", 1]]
---
  def destroy
    @skill.destroy

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_skill
      @skill = Skill.find(params[:id])