portfolio/app/controllers/skills_controller.rb

  def index
    @skills = Skill.all
---
SELECT "skills".* FROM "skills"

  def create
    @skill = Skill.new(skill_params)
    @skill.profile_id = 1

    respond_to do |format|
      if @skill.save
---
INSERT INTO "skills" ("name", "year", "created_at", "updated_at", "profile_id") VALUES (?, ?, ?, ?, ?)  [["name", "Fazer Café"], ["year", 18], ["created_at", 2016-09-15 18:06:17 UTC], ["updated_at", 2016-09-15 18:06:17 UTC], ["profile_id", 1]]

  def update
    respond_to do |format|
      if @skill.update(skill_params)
---
UPDATE "skills" SET "name" = ?, "year" = ?, "updated_at" = ? WHERE "skills"."id" = ?  [["name", "Ruby"], ["year", 0], ["updated_at", 2016-09-14 18:00:06 UTC], ["id", 4]]

    def set_skill
      @skill = Skill.find(params[:id])
---
SELECT  "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]